k6-tests-result/set-tc/k6-report-dotnet-runtime-thread-pool.txt
# k6 性能測試報告

## 測試概述

*   **測試工具**: k6
*   **測試目標 API**: 使用 .NET Runtime 自行控制 Thread Pool 的版本
*   **API 執行資源**: 2 核心 CPU & 4GB 記憶體
*   **測試時間**: 2025年7月4日

## 測試結果摘要

本次 k6 性能測試旨在評估在特定資源配置下，使用 .NET Runtime 自行控制 Thread Pool 的 API 性能表現。測試結果顯示，儘管請求失敗率極低，但響應時間遠超預期，表明在高負載下存在嚴重的性能瓶頸。

## 詳細測試數據

### 閾值檢查 (THRESHOLDS)

| 指標              | 設定閾值      | 實際結果      | 通過狀態 | 說明                                     |
| :---------------- | :------------ | :------------ | :------- | :--------------------------------------- |
| `http_req_duration` | `p(95)<3000ms` | `p(95)=27.72s` | ✗        | 95% 的 HTTP 請求響應時間應小於 3 秒，但實際為 27.72 秒，未通過。 |
| `http_req_failed`   | `rate<0.01`   | `rate=0.07%`  | ✓        | HTTP 請求失敗率應小於 1%，實際為 0.07%，通過。 |

### 總體結果 (TOTAL RESULTS)

*   **總檢查數**: 6422
*   **檢查成功率**: 99.92% (6417 次成功)
*   **檢查失敗率**: 0.07% (5 次失敗)
*   **HTTP 200 響應**: 99% (6417 次成功 / 5 次失敗)

### HTTP 指標

*   **`http_req_duration` (HTTP 請求持續時間)**:
    *   平均 (avg): 10.03 秒
    *   最小 (min): 0 秒
    *   中位數 (med): 7.56 秒
    *   最大 (max): 1 分 4 秒
    *   90% 分位數 (p(90)): 22.22 秒
    *   95% 分位數 (p(95)): 27.72 秒
*   **`http_req_failed` (HTTP 請求失敗率)**: 0.07% (5 次失敗)
*   **`http_reqs` (HTTP 請求總數)**: 6422 (19.358226 次/秒)

### 執行指標

*   **`iteration_duration` (迭代持續時間)**:
    *   平均 (avg): 9.42 秒
    *   最小 (min): 96.28 毫秒
    *   中位數 (med): 7.11 秒
    *   最大 (max): 1 分 0 秒
    *   90% 分位數 (p(90)): 20.74 秒
    *   95% 分位數 (p(95)): 26.07 秒
*   **`iterations` (迭代總數)**: 6422 (19.358226 次/秒)
*   **`vus` (虛擬用戶數)**:
    *   當前活躍: 2
    *   測試期間最小/最大: 0 / 200
*   **`vus_max` (最大虛擬用戶數)**:
    *   配置最大: 200
    *   測試期間最小/最大: 170 / 200

### 網絡指標

*   **`data_received` (接收數據量)**: 590 KB (1.8 KB/秒)
*   **`data_sent` (發送數據量)**: 34 GB (102 MB/秒)

## 測試運行狀態

*   **總運行時間**: 5 分 31.7 秒
*   **虛擬用戶狀態**: 0/200 VUs (測試結束時)
*   **完成迭代數**: 6422
*   **中斷迭代數**: 0
*   **測試場景**: default ✓ [ 100% ] 200 VUs 5m0s

## 結論與建議

本次測試結果明確指出，在 2 核心 CPU 和 4GB 記憶體的資源配置下，使用 .NET Runtime 自行控制 Thread Pool 的 API 在高負載情境下存在嚴重的性能問題。儘管請求失敗率控制在可接受範圍內，但絕大多數請求的響應時間遠超預期，這將嚴重影響用戶體驗。

**主要問題點**:

*   **響應時間過長**: 95% 的請求響應時間高達 27.72 秒，遠遠超過 3 秒的閾值。這表明 API 在處理併發請求時存在顯著的延遲。

**建議**:

1.  **性能瓶頸分析**: 立即對 API 進行深入的性能分析，找出導致響應時間過長的核心瓶頸。這可能包括：
    *   **CPU 使用率**: 檢查 API 在高負載下的 CPU 使用率，判斷是否達到瓶頸。
    *   **記憶體使用**: 監控記憶體使用情況，是否存在記憶體洩漏或頻繁的垃圾回收。
    *   **Thread Pool 配置**: 重新審視 .NET Thread Pool 的配置，包括最小/最大線程數，是否與當前工作負載和硬體資源匹配。考慮是否需要調整 `SetMinThreads` 或 `SetMaxThreads`。
    *   **I/O 操作**: 檢查是否有大量的磁盤 I/O 或網絡 I/O 操作導致阻塞。
    *   **數據庫性能**: 如果 API 涉及數據庫操作，檢查數據庫的響應時間和連接池使用情況。
    *   **鎖競爭/同步**: 檢查代碼中是否存在過多的鎖競爭或不必要的同步操作，導致線程阻塞。
2.  **代碼優化**: 針對性能瓶頸點進行代碼優化，例如：
    *   優化算法和數據結構。
    *   減少不必要的計算或數據處理。
    *   使用異步編程模型 (async/await) 避免阻塞。
    *   優化數據庫查詢。
3.  **資源擴展評估**: 如果代碼優化後仍無法滿足性能要求，則需要評估是否需要增加 API 服務器的 CPU 核心數或記憶體。
4.  **持續監控**: 在生產環境中部署後，應持續監控 API 的性能指標，以便及時發現並解決潛在問題。

## 原始 k6 測試輸出

```
█ THRESHOLDS

    http_req_duration
    ✗ 'p(95)<3000' p(95)=27.72s

    http_req_failed
    ✓ 'rate<0.01' rate=0.07%


  █ TOTAL RESULTS

    checks_total.......................: 6422   19.358226/s
    checks_succeeded...................: 99.92% 6417 out of 6422
    checks_failed......................: 0.07%  5 out of 6422

    ✗ HTTP 200
      ↳  99% — ✓ 6417 / ✗ 5

    HTTP
    http_req_duration.......................................................: avg=10.03s min=0s      med=7.56s max=1m4s p(90)=22.22s p(95)=27.72s
      { expected_response:true }............................................: avg=10s    min=93.92ms med=7.56s max=1m4s p(90)=22.18s p(95)=27.67s
    http_req_failed.........................................................: 0.07%  5 out of 6422
    http_reqs...............................................................: 6422   19.358226/s

    EXECUTION
    iteration_duration......................................................: avg=9.42s  min=96.28ms med=7.11s max=1m0s p(90)=20.74s p(95)=26.07s
    iterations..............................................................: 6422   19.358226/s
    vus.....................................................................: 2      min=0         max=200
    vus_max.................................................................: 200    min=170       max=200

    NETWORK
    data_received...........................................................: 590 kB 1.8 kB/s
    data_sent...............................................................: 34 GB  102 MB/s



running (5m31.7s), 000/200 VUs, 6422 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  5m0s
time="2025-07-04T03:33:36Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"
```