k6-tests-result/set-tc/k6-result-preset-thread-pool.txt
█ THRESHOLDS

    http_req_duration
    ✗ 'p(95)<3000' p(95)=16.16s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......................: 6494    19.480255/s
    checks_succeeded...................: 100.00% 6494 out of 6494
    checks_failed......................: 0.00%   0 out of 6494

    ✓ HTTP 200

    HTTP
    http_req_duration.......................................................: avg=9.95s min=132.88ms med=9.58s max=32.46s p(90)=14.44s p(95)=16.16s
      { expected_response:true }............................................: avg=9.95s min=132.88ms med=9.58s max=32.46s p(90)=14.44s p(95)=16.16s
    http_req_failed.........................................................: 0.00%  0 out of 6494
    http_reqs...............................................................: 6494   19.480255/s

    EXECUTION
    iteration_duration......................................................: avg=9.33s min=144.6ms  med=9s    max=31.5s  p(90)=13.09s p(95)=14.73s
    iterations..............................................................: 6494   19.480255/s
    vus.....................................................................: 10     min=0         max=200
    vus_max.................................................................: 200    min=178       max=200

    NETWORK
    data_received...........................................................: 597 kB 1.8 kB/s
    data_sent...............................................................: 34 GB  102 MB/s



running (5m33.4s), 000/200 VUs, 6494 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  5m0s
time="2025-07-04T05:28:35Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"